yuplus/nxp-mcx-series/MCXE247/drivers/fsl_flexcan.c
    uint8_t instance;

    /* Clean FlexCAN transfer handle. */
    (void)memset(handle, 0, sizeof(*handle));

    /* Get instance from peripheral base address. */
    instance = (uint8_t)FLEXCAN_GetInstance(base);

    /* Save the context in global variables to support the double weak mechanism. */
    s_flexcanHandle[instance] = handle;

    /* Register Callback function. */
    handle->callback = callback;
    handle->userData = userData;

    s_flexcanIsr = FLEXCAN_TransferHandleIRQ;
    s_flexcanMbIsr = FLEXCAN_MbHandleIRQ;
    s_flexcanBusoffErrorIsr = FLEXCAN_BusoffErrorHandleIRQ;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_PN_MODE) && FSL_FEATURE_FLEXCAN_HAS_PN_MODE)
    s_flexcanPNWakeUpErrorIsr = FLEXCAN_PNWakeUpHandleIRQ;
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL) && FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL)
    s_flexcanMemoryErrorErrorIsr = FLEXCAN_MemoryErrorHandleIRQ;
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO) && FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO)
    s_flexcanEhancedRxFifoIsr = FLEXCAN_EhancedRxFifoHandleIRQ;
#endif

    /* We Enable Error & Status interrupt here, because this interrupt just
     * report current status of FlexCAN module through Callback function.
     * It is insignificance without a available callback function.
     */
    if (handle->callback != NULL)
    {
        FLEXCAN_EnableInterrupts(
            base, (uint32_t)kFLEXCAN_BusOffInterruptEnable | (uint32_t)kFLEXCAN_ErrorInterruptEnable |
                      (uint32_t)kFLEXCAN_RxWarningInterruptEnable | (uint32_t)kFLEXCAN_TxWarningInterruptEnable
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_SLFWAK_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_SLFWAK_SUPPORT)
                      | (uint32_t)kFLEXCAN_WakeUpInterruptEnable
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_PN_MODE) && FSL_FEATURE_FLEXCAN_HAS_PN_MODE)
                      | (uint64_t)kFLEXCAN_PNMatchWakeUpInterruptEnable |
                      (uint64_t)kFLEXCAN_PNTimeoutWakeUpInterruptEnable
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL) && FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL)
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_HANCEI_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_HANCEI_SUPPORT)
                    | (uint64_t)kFLEXCAN_HostAccessNCErrorInterruptEnable |
#endif
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_FANCEI_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_FANCEI_SUPPORT)
                    (uint64_t)kFLEXCAN_FlexCanAccessNCErrorInterruptEnable |
#endif
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_CEI_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_CEI_SUPPORT)
                    (uint64_t)kFLEXCAN_HostOrFlexCanCErrorInterruptEnable
#endif
#endif
        );
    }
    else
    {
        FLEXCAN_DisableInterrupts(
            base, (uint32_t)kFLEXCAN_BusOffInterruptEnable | (uint32_t)kFLEXCAN_ErrorInterruptEnable |
                      (uint32_t)kFLEXCAN_RxWarningInterruptEnable | (uint32_t)kFLEXCAN_TxWarningInterruptEnable
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_SLFWAK_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_SLFWAK_SUPPORT)
                      |(uint32_t)kFLEXCAN_WakeUpInterruptEnable
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_PN_MODE) && FSL_FEATURE_FLEXCAN_HAS_PN_MODE)
                      | (uint64_t)kFLEXCAN_PNMatchWakeUpInterruptEnable |
                      (uint64_t)kFLEXCAN_PNTimeoutWakeUpInterruptEnable
#endif
#if (defined(FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL) && FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL)
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_HANCEI_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_HANCEI_SUPPORT)
                    | (uint64_t)kFLEXCAN_HostAccessNCErrorInterruptEnable |
#endif
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_FANCEI_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_FANCEI_SUPPORT)
                    (uint64_t)kFLEXCAN_FlexCanAccessNCErrorInterruptEnable |
#endif
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_CEI_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_CEI_SUPPORT)
                    (uint64_t)kFLEXCAN_HostOrFlexCanCErrorInterruptEnable
#endif
#endif
        );
    }

    /* Enable interrupts in NVIC. */
#ifdef CAN_Rx_Warning_IRQS
    (void)EnableIRQ((IRQn_Type)(s_flexcanRxWarningIRQ[instance]));
#endif
#ifdef CAN_Tx_Warning_IRQS
    (void)EnableIRQ((IRQn_Type)(s_flexcanTxWarningIRQ[instance]));
#endif
#ifdef CAN_Wake_Up_IRQS
    (void)EnableIRQ((IRQn_Type)(s_flexcanWakeUpIRQ[instance]));
#endif
#ifdef CAN_Error_IRQS
    (void)EnableIRQ((IRQn_Type)(s_flexcanErrorIRQ[instance]));
#endif
#ifdef CAN_Bus_Off_IRQS
    (void)EnableIRQ((IRQn_Type)(s_flexcanBusOffIRQ[instance]));
#endif
#ifdef CAN_ORed_Message_buffer_IRQS
#ifdef FSL_FEATURE_FLEXCAN_MB_IRQ_COUNT
    for (uint32_t i = 0; i < (uint32_t)FSL_FEATURE_FLEXCAN_MB_IRQ_COUNT; i++)
    {
        (void)EnableIRQ((IRQn_Type)(s_flexcanMbIRQ[instance][i]));
    }
#else
    (void)EnableIRQ((IRQn_Type)(s_flexcanMbIRQ[instance]));
#endif
#endif
}

/*!
 * brief Sends a message using IRQ.
 *
 * This function sends a message using IRQ. This is a non-blocking function, which returns
 * right away. When messages have been sent out, the send callback function is called.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param pMbXfer FlexCAN Message Buffer transfer structure. See the #flexcan_mb_transfer_t.
 * retval kStatus_Success        Start Tx Message Buffer sending process successfully.
 * retval kStatus_Fail           Write Tx Message Buffer failed.
 * retval kStatus_FLEXCAN_TxBusy Tx Message Buffer is in use.
 */
status_t FLEXCAN_TransferSendNonBlocking(CAN_Type *base, flexcan_handle_t *handle, flexcan_mb_transfer_t *pMbXfer)
{
    /* Assertion. */
    assert(NULL != handle);
    assert(NULL != pMbXfer);
    assert(pMbXfer->mbIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
#if !defined(NDEBUG)
    assert(!FLEXCAN_IsMbOccupied(base, pMbXfer->mbIdx));
#endif

    status_t status;

