yuplus/nxp-mcx-series/MCXE247/drivers/fsl_flexcan.c
        /* To handle FlexCAN Error and Status Interrupt first. */
        if (0U != (result & FLEXCAN_ERROR_AND_STATUS_INT_FLAG))
        {
            status = kStatus_FLEXCAN_ErrorStatus;
            /* Clear FlexCAN Error and Status Interrupt. */
            FLEXCAN_ClearStatusFlags(base, FLEXCAN_ERROR_AND_STATUS_INT_FLAG);
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
            if ((1 == FSL_FEATURE_FLEXCAN_INSTANCE_HAS_FLEXIBLE_DATA_RATEn(base)) && \
                (0U != (base->ESR1 & CAN_ESR1_ERROVR_MASK)))
            {
                base->ESR1 = CAN_ESR1_ERROVR_MASK;
            }
#endif
        }
        else if (0U != (result & FLEXCAN_WAKE_UP_FLAG))
        {
            status = kStatus_FLEXCAN_WakeUp;
            FLEXCAN_ClearStatusFlags(base, FLEXCAN_WAKE_UP_FLAG);
        }
#if (defined(FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO) && FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO)
        else if (0U != (FLEXCAN_EFIFO_STATUS_UNMASK(result & FLEXCAN_MEMORY_ENHANCED_RX_FIFO_INT_FLAG) & base->ERFIER))
        {
            status = FLEXCAN_SubHandlerForEhancedRxFifo(base, handle, result);
        }
#endif
        else
        {
            /* To handle Message Buffer or Legacy Rx FIFO transfer. */
            status = FLEXCAN_SubHandlerForDataTransfered(base, handle,
                0U, (uint32_t)FSL_FEATURE_FLEXCAN_HAS_MESSAGE_BUFFER_MAX_NUMBERn(base) - 1U, &mbNum);
            result = mbNum;
        }

        /* Calling Callback Function if has one. */
        if (handle->callback != NULL)
        {
            handle->callback(base, handle, status, result, handle->userData);
        }
    } while (FLEXCAN_CheckUnhandleInterruptEvents(base));
}

/*!
 * brief FlexCAN Message Buffer IRQ handle function.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 * param startMbIdx First Message Buffer to handle.
 * param endMbIdx Last Message Buffer to handle.
 */
void FLEXCAN_MbHandleIRQ(CAN_Type *base, flexcan_handle_t *handle, uint32_t startMbIdx, uint32_t endMbIdx)
{
    status_t status;
    uint32_t mbNum;
    mbNum = 0xFFU;

    /* Handle Message Buffer or Legacy Rx FIFO transfer. */
    status = FLEXCAN_SubHandlerForDataTransfered(base, handle, startMbIdx, endMbIdx, &mbNum);

    if (handle->callback != NULL)
    {
        handle->callback(base, handle, status, mbNum, handle->userData);
    }
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO) && FSL_FEATURE_FLEXCAN_HAS_ENHANCED_RX_FIFO)
/*!
 * brief FlexCAN Ehanced Rx FIFO IRQ handle function.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 */
void FLEXCAN_EhancedRxFifoHandleIRQ(CAN_Type *base, flexcan_handle_t *handle)
{
    status_t status;
    uint64_t result;
    uint32_t enableInt;
    result = FLEXCAN_GetStatusFlags(base);
    enableInt = base->ERFIER;
    enableInt &= (CAN_ERFIER_ERFUFWIE_MASK | CAN_ERFIER_ERFOVFIE_MASK | CAN_ERFIER_ERFWMIIE_MASK |
                  CAN_ERFIER_ERFDAIE_MASK);

    if (0U != (FLEXCAN_EFIFO_STATUS_UNMASK(result & FLEXCAN_MEMORY_ENHANCED_RX_FIFO_INT_FLAG) & enableInt))
    {
        status = FLEXCAN_SubHandlerForEhancedRxFifo(base, handle, result);

        if (handle->callback != NULL)
        {
            handle->callback(base, handle, status, result, handle->userData);
        }
    }
}
#endif

/*!
 * brief FlexCAN Bus Off, Error and Warning IRQ handle function.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 */
void FLEXCAN_BusoffErrorHandleIRQ(CAN_Type *base, flexcan_handle_t *handle)
{
    uint32_t statusReg;
    uint32_t enableInt;
    uint32_t reg;
    statusReg = base->ESR1;
    reg = base->CTRL1;
    enableInt = (reg & (CAN_CTRL1_TWRNMSK_MASK | CAN_CTRL1_RWRNMSK_MASK)) << 6U;
    enableInt |= ((reg & (CAN_CTRL1_ERRMSK_MASK | CAN_CTRL1_BOFFMSK_MASK)) >> 13U);
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
    if (1 == FSL_FEATURE_FLEXCAN_INSTANCE_HAS_FLEXIBLE_DATA_RATEn(base))
    {
        reg = base->CTRL2;
        enableInt |= ((reg & (CAN_CTRL2_ERRMSK_FAST_MASK | CAN_CTRL2_BOFFDONEMSK_MASK)) >> 10U);
    }
#endif

    if (0U != (statusReg & enableInt))
    {
        base->ESR1 = FLEXCAN_ERROR_AND_STATUS_INT_FLAG;
#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
        if ((1 == FSL_FEATURE_FLEXCAN_INSTANCE_HAS_FLEXIBLE_DATA_RATEn(base)) && \
            (0U != (statusReg & CAN_ESR1_ERROVR_MASK)))
        {
            base->ESR1 = CAN_ESR1_ERROVR_MASK;
        }
#endif
        if (handle->callback != NULL)
        {
            handle->callback(base, handle, kStatus_FLEXCAN_ErrorStatus, statusReg, handle->userData);
        }
    }
}

#if (defined(FSL_FEATURE_FLEXCAN_HAS_PN_MODE) && FSL_FEATURE_FLEXCAN_HAS_PN_MODE)
/*!
 * brief FlexCAN Pretended Networking Wake-up IRQ handle function.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 */
void FLEXCAN_PNWakeUpHandleIRQ(CAN_Type *base, flexcan_handle_t *handle)
{
    uint64_t result;
    uint32_t enableInt;
    result = FLEXCAN_GetStatusFlags(base);
    enableInt = base->CTRL1_PN;
    enableInt &= (CAN_CTRL1_PN_WTOF_MSK_MASK | CAN_CTRL1_PN_WUMF_MSK_MASK);

    if (0U != (FLEXCAN_PN_STATUS_UNMASK(result & FLEXCAN_PNWAKE_UP_FLAG) & enableInt))
    {
        base->WU_MTC = FLEXCAN_PN_STATUS_UNMASK(FLEXCAN_PNWAKE_UP_FLAG);

        if (handle->callback != NULL)
        {
            handle->callback(base, handle, kStatus_FLEXCAN_WakeUp, result, handle->userData);
        }
    }
}
#endif

#if (defined(FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL) && FSL_FEATURE_FLEXCAN_HAS_MEMORY_ERROR_CONTROL)
/*!
 * brief FlexCAN Memory Error IRQ handle function.
 *
 * param base FlexCAN peripheral base address.
 * param handle FlexCAN handle pointer.
 */
void FLEXCAN_MemoryErrorHandleIRQ(CAN_Type *base, flexcan_handle_t *handle)
{
    uint64_t result;
    uint32_t enableInt;
    result = FLEXCAN_GetStatusFlags(base);
    enableInt = base->MECR;
    enableInt &= (CAN_MECR_HANCEI_MSK_MASK | CAN_MECR_FANCEI_MSK_MASK | CAN_MECR_CEI_MSK_MASK);

